// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

let a = [1, 2, 3, 4, 5];
let b = ['a', 'b', 'c', 'd', 'e'];
let c = [1, 2, 'a', 'b', true]
console.log(a);
console.log(b);
console.log(c);
// ******************************************************************


// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let empty = [];
empty[0] = 10;
empty[1] = 20;
empty[2] = 'aaa';
empty[3] = 'bbb';
empty[4] = false;
console.log(empty);
// ******************************************************************


// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
for (let i = 0; i < 10; i++) {
    document.write(`<div>10 блоків div c довільним текстом всередині</div>`);
}
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
for (let i = 0; i < 10; i++) {
    document.write(`<div>${i}. 10 блоків div c довільним текстом і індексом всередині</div>`);
}
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
for (let i = 0; i < 20; i++) {
    document.write(`<h1>20 блоків h1 c довільним текстом всередині</h1>`);
}
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
for (let i = 0; i < 20; i++) {
    document.write(`<h1>${i}. 20 блоків h1 c довільним текстом і індексом всередині</h1>`);
}
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let num10 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (let i = 0; i < num10.length; i++) {
    console.log(num10[i])
}
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let str10 = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'];
for (let i = 0; i < str10.length; i++) {
    console.log(str10[i]);
}
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
let numStr = ['a', 'b', 'c', 'd', 1, 2, 3, 4, true, false];
for (let i = 0; i < numStr.length; i++) {
    console.log(numStr[i]);
}
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
for (const numStrElement of numStr) {
    if (typeof numStrElement === "boolean")
        console.log(numStrElement);
}
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
for (const numStrElement of numStr) {
    if (typeof numStrElement === "number")
        console.log(numStrElement);
}
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
for (const numStrElement of numStr) {
    if (typeof numStrElement === "string")
        console.log(numStrElement);
}
// ******************************************************************

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
let empty2 = [];
empty2[0] = 'a';
empty2[1] = 'b';
empty2[2] = 1;
empty2[3] = 2;
empty2[4] = true;
console.log(empty2);
for (let i = 0; i < empty2.length; i++) {
    console.log(empty2);
}
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for (let i = 0; i < 10; i++) {
    console.log(`10  ітерацій з кроком 1 - ${i}`);
    document.write(`10  ітерацій з кроком 1 - ${i}<br>`)
}
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
for (let i = 0; i < 100; i++) {
    console.log(`100  ітерацій з кроком 1 - ${i}`);
    document.write(`100  ітерацій з кроком 1 - ${i}<br>`);
}
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
let step = 0;
for (let i = 0; i < 100; i ++) {
    console.log(`100 ітерацій з кроком 2 - ${step}`);
    document.write(`100 ітерацій з кроком 2 - ${step}<br>`);
    step+=2;
}
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
for (let i = 0; i < 100; i++) {
    if (i % 2 === 0) {
        console.log(`100 ітерацій лише парні - ${i}`)
        document.write(`100 ітерацій лише парні - ${i}<br>`);
    }
}
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
for (let i = 0; i < 100; i++) {
    if (i % 2 !== 0) {
        console.log(`100 ітерацій лише непарні - ${i}`);
        document.write(`100 ітерацій лише непарні - ${i}<br>`);
    }
}
// ******************************************************************

// - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
let second = 0;
let minute = 0;
let hour = 0;
let time = 59;

for (let i = 0; i <= time; i++) {
    console.log('хвилина:', minute++);
    for (let i = 0; i <= time; i++) {
        console.log('секунда:', second++);
    }
    second = 0;
    if (minute === 2) {
        break
    }
}
// ******************************************************************
// - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
for (let i = 0; i <= 23 && hour !== 2 && minute !== 20; i++) {
    hour = i;

    for (let i = 0; i <= time; i++) {
        minute = i
        if (hour === 2 && minute === 20) {
            break
        }

        for (let i = 0; i <= time; i++) {
            second = i
            console.log(`Година: ${hour} Хвилина: ${minute} Секунда: ${second}`)
        }
        second = 0
    }
    minute = 0
}